Cylinder Flow/Re_100/Allrun
#!/bin/bash
cd "$(dirname "$0")"
source /home/rinkoa/OpenFOAM-v2012/etc/bashrc

echo "=== Re=100, U=0.0015 m/s ==="
blockMesh 2>&1 | tee log.blockMesh
snappyHexMesh -overwrite 2>&1 | tee log.snappyHexMesh
checkMesh 2>&1 | tee log.checkMesh
decomposePar 2>&1 | tee log.decomposePar
mpirun -np 4 pimpleFoam -parallel 2>&1 | tee log.pimpleFoam
reconstructPar 2>&1 | tee log.reconstructPar
