Cylinder Flow/Re_100/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    cylinder
    {
        type    searchableCylinder;
        point1  (0 0 -1);
        point2  (0 0 2);
        radius  0.5;
    }
};

castellatedMeshControls
{
    maxLocalCells       1000000;
    maxGlobalCells      4000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 4;

    features
    (
    );

    refinementSurfaces
    {
        cylinder
        {
            level (4 4);
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        cylinder
        {
            mode    distance;
            levels  ((1.0 3) (3.0 1));
        }
    }

    locationInMesh (5 0 0.5);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      30;
    nRelaxIter      5;
    nFeatureSnapIter 10;
}

addLayersControls
{
    relativeSizes   true;
    layers          {}
    expansionRatio  1.2;
    finalLayerThickness 0.5;
    minThickness    0.001;
    nGrow           0;
    featureAngle    60;
    nRelaxIter      5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter      50;
}

meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   1e-30;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.02;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
}

debug 0;
mergeTolerance 1e-6;
